package com.android.opus.domain

object FieldOfActivityMockData {
    fun getResult(): List<String>? {
        return listOf("Администрирование",
            "Офис",
            "Аналитика",
            "Поддержка",
            "Бэкэнд",
            "Приложения",
            "Дизайн",
            "Продажи",
            "Информационная",
            "Разработка ПО",
            "Кадры",
            "Телеком",
            "Контент",
            "Тестирование",
            "Маркетинг",
            "Фронтенд",
            "Менеджмент",
            "Другое")
    }

}